experiments/tsung_websocket.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1000" />
    </clients>

    <servers>
        <server host="127.0.0.1" port="8000" type="tcp" />
    </servers>

    <load>
        <arrivalphase phase="1" duration="120" unit="second">
            <users maxnumber="1000" arrivalrate="10" unit="second" />
        </arrivalphase>
    </load>

    <options>
        <option name="global_number" value="1000"></option>
        <option name="websocket_path" value="/articles"/>
    </options>

    <sessions>
        <session name="websocket-connections" weight="20" type="ts_websocket">
            <request>
                <websocket type="connect"></websocket>
            </request>
            <request>
                <websocket type="message" frame="text" ack="no_ack">
                    {"greeting":"hello"}
                </websocket>
            </request>
            <thinktime value="120" random="true"></thinktime>
            <request>
                <websocket type="close"></websocket>
            </request>
        </session>
        <session name="publisher" weight="1" type="ts_http">
            <request subst="true">
                <http url="/api/articles/" method="POST" version="1.1"
                    contents="title=%%ts_user_server:get_unique_id%%&amp;body=This+is+the+body">
                    <www_authenticate userid="cobusc" passwd="foobarpas"/>
                </http>
            </request>
        </session>
    </sessions>
</tsung>