experiments/tsung_websocket.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1000" />
    </clients>

    <servers>
        <server host="127.0.0.1" port="8000" type="tcp" />
    </servers>

    <load>
        <arrivalphase phase="1" duration="120" unit="second">
            <users maxnumber="1000" arrivalrate="10" unit="second" />
        </arrivalphase>
    </load>

    <options>
        <option name="global_number" value="1000"></option>
        <option name="websocket_path" value="articles"/>
    </options>

    <sessions>
        <session name="websocket-connections" weight="10" type="ts_websocket">
            <request>
                <websocket type="connect"></websocket>
            </request>
            <!-- <request>
                <websocket type="message" frame="text" ack="no_ack">
                    {"greeting": "2867865225003669442826455604983179963965839852965721255676827662815696261243172347789319941760086956841965972700488642307045998675445189849609967378621179958073791426749071929893397188800652848434847092204652299777212519222211211855775790000672091949348154957381093342803689165122900820157088604214710502544876982691049541677186794836992989079740817470605462087183753892043144454972158817946948946846873753596268760733357119146627102186168829460473430237573969632881043182702791429564012052045914119507177013466017683361896410615937679211596486179865647392870635436678987536715133198284973093222583966794178115970438760485533505646234130050245188848572209672049045875030270825541569291261774669278244106484828994632562101627549885941841239456897046254146146753094478034086813219933215422175735000653202662472156102866134886087009703639642096226577723775317689111392189874003378194890920193852284575948889936107770362650428857291232870576275298576598547537064712932903036903959252994976552148022399172352350540836780723068926265599430911839657677557622985839797342281852749452094422457510612646139387975714094893457608648370452911166293025732673098563711917350608799043711114596917413088573518842105072077291635994948244282848929551583843146542858830924646837561091577615306412825930019751895356249723968659386320571413954180682126480826934558995094745140923185080150305914142566631321515964797235381322579264609397170933425248511820769298757817538175883456769241770268391574850318357185927701851379439604231217379898775230591002605892467013739904633668695753609626491937049172768000677034310548400845583026662141260668337029608140712541413032574640374266803209889769669657329257230191380168377374259659709783837636047059101730334292478246111073565105294973384523707786032452448340167890292244313345347370404462083139036509318045222023989938255845241837330172145516765920655016069883702212753989145539947033108063481474285686348570645162072862861624249448943577045380466719996250693879633873774745643418481237613355737348391967117336019335590032374339934710772460377361255107264919083061950473803225121688723553924370265448433268904799607285835097258954763495613423971231691404200561466639135531565670401262273873303874928556793490722740814325065140633473990574329929180940887355915555528341520381824811864964806989793259622419798380018188348968598861956700554403395580473055947946028171692117610444375250686532269657216932451458583291414278069762224007837918758822678563839011980527485926370136963793180184536359401966813639646085351278121903035969684857607519918402864950459066720163880069218205239977237614967438636832898767016828228038063021522246582231202305575167888149043817722265491913732748522580146762311958874636140039589265992550925417023826375368630790904732829118892660794002491100965602617814334201120957100433131519892302615816399517516708688323515429589963680229337861430389712426743161516643838171371933712602780018744918584046197467074320597692107666800183289246115208568479946132832311131569789178195752595201302186009990877627622319252766398163745291099040970419210304870737289380891244490047241686594624583732488927361829333366702226736603453801890418728529348078155412960044881761866799206006803600363726062680419712302499372595474635441522853117681790229458503356235859014114037467506695579714816567577063901307345491267448741908477220033205842357034707468452867895422642976756602251205584532792899075301764472641561079730376314486075212548440725405314947913315845746415080665907097986000163644205155225454662060222320741403412301478741833386537641271694873414300533987905504425124635781852095681122604197901740156064277009304428804168257191656241411187402556390497793596388049356621206490534305895198276189976121480248556994745980524970168714790810833848256648526535772464785732755224104335748836070109436524525604190069363908098312516925205828939047290185103052977857606863337807859883895426817746688835369439736651133051390302105253502066225282791331768768744502969968337956141053012409" }
                </websocket>
            </request> -->
            <!--            <request>
                <match do="log" when="nomatch">ok</match>
                <match do="loop" sleep_loop="5" when="nomatch">ok</match>
                <websocket type="message" frame="text">
                    {"greeting":"How are you?"}
                </websocket>
            </request> -->
            <thinktime value="120" random="false"></thinktime>
            <request>
                <websocket type="close"></websocket>
            </request>
        </session>
        <session name="publisher" weight="1" type="ts_http">
            <request subst="true">
                <http url="/api/articles/" method="POST" version="1.1"
                    contents="title=%%ts_user_server:get_unique_id%%&amp;body=This+is+the+body">
                    <www_authenticate userid="cobusc" passwd="foobarpas"/>
                </http>
            </request>
        </session>
    </sessions>
</tsung>