experiments/tsung_websocket.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1000" />
    </clients>

    <servers>
        <!-- When serving through Nginx, Tsung only works of the type of the
             server is "websocket". This breaks the messages sent via the
             websocket, though.
             Remember to change the port in the POST session as well.
        -->
        <server host="127.0.0.1" port="8000" type="websocket" weight="0"/>
        <!-- Use type="tcp" when connecting directly to the application. -->
        <server host="127.0.0.1" port="8001" type="tcp" weight="0"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="120" unit="second">
            <users maxnumber="1000" arrivalrate="10" unit="second" />
        </arrivalphase>
    </load>

    <options>
        <option name="global_number" value="1000"></option>
        <option name="websocket_path" value="/articles"/>
        <!-- <option name="websocket_frame" value="text"/> -->
    </options>

    <sessions>
        <session name="websocket-connections" weight="10" type="ts_websocket">
            <request>
                <websocket type="connect"></websocket>
            </request>
            <request>
                <websocket type="message" frame="text" ack="no_ack">{"greeting": "Hello"}</websocket>
            </request>
            <request>
                <match do="log" when="nomatch">ok</match>
                <match do="loop" sleep_loop="5" when="nomatch">ok</match>
                <websocket type="message" frame="text" ack="no_ack">{"greeting":"How are you?"}
                </websocket>
            </request>
            <thinktime value="150" random="false"></thinktime>
            <request>
                <websocket type="close"></websocket>
            </request>
        </session>
        <session name="publisher" weight="1" type="ts_http">
            <change_type new_type="ts_http" host="127.0.0.1" port="8000" server_type="tcp" restore="true" store="true" bidi="true"/>
            <request subst="true">
                <http url="/api/articles/" method="POST" version="1.1"
                    contents="title=%%ts_user_server:get_unique_id%%&amp;body=This+is+the+body">
                    <www_authenticate userid="cobusc" passwd="foobarpas"/>
                </http>
            </request>
        </session>
    </sessions>
</tsung>